grevaillot/svd_tools/headers/STM32H743x/rcc.h
/** RCC_BDCR_LSEBYP LSE oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY LSE oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON LSE oscillator enabled **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR RCC Clock Control and Status Register
@{*/

/** RCC_CSR_LSIRDY LSI oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION LSI oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3rstr AHB3RSTR RCC AHB3 Reset Register
@{*/

/** RCC_AHB3RSTR_CPURST CPU reset **/
#define RCC_AHB3RSTR_CPURST		(1 << 31)
/** RCC_AHB3RSTR_SDMMC1RST SDMMC1 and SDMMC1 delay block reset **/
#define RCC_AHB3RSTR_SDMMC1RST		(1 << 16)
/** RCC_AHB3RSTR_QSPIRST QUADSPI and QUADSPI delay block reset **/
#define RCC_AHB3RSTR_QSPIRST		(1 << 14)
/** RCC_AHB3RSTR_FMCRST FMC block reset **/
#define RCC_AHB3RSTR_FMCRST		(1 << 12)
/** RCC_AHB3RSTR_JPGDECRST JPGDEC block reset **/
#define RCC_AHB3RSTR_JPGDECRST		(1 << 5)
/** RCC_AHB3RSTR_DMA2DRST DMA2D block reset **/
#define RCC_AHB3RSTR_DMA2DRST		(1 << 4)
/** RCC_AHB3RSTR_MDMARST MDMA block reset **/
#define RCC_AHB3RSTR_MDMARST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1rstr AHB1RSTR RCC AHB1 Peripheral Reset Register
@{*/

/** RCC_AHB1RSTR_USB2OTGRST USB2OTG block reset **/
#define RCC_AHB1RSTR_USB2OTGRST		(1 << 27)
/** RCC_AHB1RSTR_USB1OTGRST USB1OTG block reset **/
#define RCC_AHB1RSTR_USB1OTGRST		(1 << 25)
/** RCC_AHB1RSTR_ETH1MACRST ETH1MAC block reset **/
#define RCC_AHB1RSTR_ETH1MACRST		(1 << 15)
/** RCC_AHB1RSTR_ADC12RST ADC1&2 block reset **/
#define RCC_AHB1RSTR_ADC12RST		(1 << 5)
/** RCC_AHB1RSTR_DMA2RST DMA2 block reset **/
#define RCC_AHB1RSTR_DMA2RST		(1 << 1)
/** RCC_AHB1RSTR_DMA1RST DMA1 block reset **/
#define RCC_AHB1RSTR_DMA1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2rstr AHB2RSTR RCC AHB2 Peripheral Reset Register
@{*/

/** RCC_AHB2RSTR_SDMMC2RST SDMMC2 and SDMMC2 Delay block reset **/
#define RCC_AHB2RSTR_SDMMC2RST		(1 << 9)
/** RCC_AHB2RSTR_RNGRST Random Number Generator block reset **/
#define RCC_AHB2RSTR_RNGRST		(1 << 6)
/** RCC_AHB2RSTR_HASHRST Hash block reset **/
#define RCC_AHB2RSTR_HASHRST		(1 << 5)
/** RCC_AHB2RSTR_CRYPTRST Cryptography block reset **/
#define RCC_AHB2RSTR_CRYPTRST		(1 << 4)
/** RCC_AHB2RSTR_CAMITFRST CAMITF block reset **/
#define RCC_AHB2RSTR_CAMITFRST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb4rstr AHB4RSTR RCC AHB4 Peripheral Reset Register
@{*/

/** RCC_AHB4RSTR_HSEMRST HSEM block reset **/
#define RCC_AHB4RSTR_HSEMRST		(1 << 25)
/** RCC_AHB4RSTR_ADC3RST ADC3 block reset **/
#define RCC_AHB4RSTR_ADC3RST		(1 << 24)
/** RCC_AHB4RSTR_BDMARST BDMA block reset **/
#define RCC_AHB4RSTR_BDMARST		(1 << 21)
/** RCC_AHB4RSTR_CRCRST CRC block reset **/
#define RCC_AHB4RSTR_CRCRST		(1 << 19)
/** RCC_AHB4RSTR_GPIOKRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOKRST		(1 << 10)
/** RCC_AHB4RSTR_GPIOJRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOJRST		(1 << 9)
/** RCC_AHB4RSTR_GPIOIRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOIRST		(1 << 8)
/** RCC_AHB4RSTR_GPIOHRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOHRST		(1 << 7)
/** RCC_AHB4RSTR_GPIOGRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOGRST		(1 << 6)
/** RCC_AHB4RSTR_GPIOFRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOFRST		(1 << 5)
/** RCC_AHB4RSTR_GPIOERST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOERST		(1 << 4)
/** RCC_AHB4RSTR_GPIODRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIODRST		(1 << 3)
/** RCC_AHB4RSTR_GPIOCRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOCRST		(1 << 2)
/** RCC_AHB4RSTR_GPIOBRST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOBRST		(1 << 1)
/** RCC_AHB4RSTR_GPIOARST GPIO block reset **/
#define RCC_AHB4RSTR_GPIOARST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb3rstr APB3RSTR RCC APB3 Peripheral Reset Register
@{*/

/** RCC_APB3RSTR_LTDCRST LTDC block reset **/
#define RCC_APB3RSTR_LTDCRST		(1 << 3)

/**@}*/

/** @defgroup rcc_apb1lrstr APB1LRSTR RCC APB1 Peripheral Reset Register
@{*/

/** RCC_APB1LRSTR_USART8RST USART8 block reset **/
#define RCC_APB1LRSTR_USART8RST		(1 << 31)
/** RCC_APB1LRSTR_USART7RST USART7 block reset **/
#define RCC_APB1LRSTR_USART7RST		(1 << 30)
/** RCC_APB1LRSTR_DAC12RST DAC1 and 2 Blocks Reset **/
#define RCC_APB1LRSTR_DAC12RST		(1 << 29)
/** RCC_APB1LRSTR_CECRST HDMI-CEC block reset **/
#define RCC_APB1LRSTR_CECRST		(1 << 27)
/** RCC_APB1LRSTR_I2C3RST I2C3 block reset **/
#define RCC_APB1LRSTR_I2C3RST		(1 << 23)
/** RCC_APB1LRSTR_I2C2RST I2C2 block reset **/
#define RCC_APB1LRSTR_I2C2RST		(1 << 22)
/** RCC_APB1LRSTR_I2C1RST I2C1 block reset **/
#define RCC_APB1LRSTR_I2C1RST		(1 << 21)
/** RCC_APB1LRSTR_UART5RST UART5 block reset **/
#define RCC_APB1LRSTR_UART5RST		(1 << 20)
/** RCC_APB1LRSTR_UART4RST UART4 block reset **/
#define RCC_APB1LRSTR_UART4RST		(1 << 19)
/** RCC_APB1LRSTR_USART3RST USART3 block reset **/
#define RCC_APB1LRSTR_USART3RST		(1 << 18)
/** RCC_APB1LRSTR_USART2RST USART2 block reset **/
#define RCC_APB1LRSTR_USART2RST		(1 << 17)
/** RCC_APB1LRSTR_SPDIFRXRST SPDIFRX block reset **/
#define RCC_APB1LRSTR_SPDIFRXRST		(1 << 16)
/** RCC_APB1LRSTR_SPI3RST SPI3 block reset **/
#define RCC_APB1LRSTR_SPI3RST		(1 << 15)
/** RCC_APB1LRSTR_SPI2RST SPI2 block reset **/
#define RCC_APB1LRSTR_SPI2RST		(1 << 14)
/** RCC_APB1LRSTR_LPTIM1RST TIM block reset **/
#define RCC_APB1LRSTR_LPTIM1RST		(1 << 9)
/** RCC_APB1LRSTR_TIM14RST TIM block reset **/
#define RCC_APB1LRSTR_TIM14RST		(1 << 8)
/** RCC_APB1LRSTR_TIM13RST TIM block reset **/
#define RCC_APB1LRSTR_TIM13RST		(1 << 7)
/** RCC_APB1LRSTR_TIM12RST TIM block reset **/
#define RCC_APB1LRSTR_TIM12RST		(1 << 6)
/** RCC_APB1LRSTR_TIM7RST TIM block reset **/
#define RCC_APB1LRSTR_TIM7RST		(1 << 5)
/** RCC_APB1LRSTR_TIM6RST TIM block reset **/
#define RCC_APB1LRSTR_TIM6RST		(1 << 4)
/** RCC_APB1LRSTR_TIM5RST TIM block reset **/
#define RCC_APB1LRSTR_TIM5RST		(1 << 3)
/** RCC_APB1LRSTR_TIM4RST TIM block reset **/
#define RCC_APB1LRSTR_TIM4RST		(1 << 2)
/** RCC_APB1LRSTR_TIM3RST TIM block reset **/
#define RCC_APB1LRSTR_TIM3RST		(1 << 1)
/** RCC_APB1LRSTR_TIM2RST TIM block reset **/
#define RCC_APB1LRSTR_TIM2RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1hrstr APB1HRSTR RCC APB1 Peripheral Reset Register
@{*/

/** RCC_APB1HRSTR_FDCANRST FDCAN block reset **/
#define RCC_APB1HRSTR_FDCANRST		(1 << 8)
/** RCC_APB1HRSTR_MDIOSRST MDIOS block reset **/
#define RCC_APB1HRSTR_MDIOSRST		(1 << 5)
/** RCC_APB1HRSTR_OPAMPRST OPAMP block reset **/
#define RCC_APB1HRSTR_OPAMPRST		(1 << 4)
/** RCC_APB1HRSTR_SWPRST SWPMI block reset **/
#define RCC_APB1HRSTR_SWPRST		(1 << 2)
/** RCC_APB1HRSTR_CRSRST Clock Recovery System reset **/
#define RCC_APB1HRSTR_CRSRST		(1 << 1)

/**@}*/

