grevaillot/svd_tools/headers/STM32H743x/rcc.h
/** @defgroup rcc_c1_ahb1lpenr C1AHB1LPENR RCC AHB1 Sleep Clock Register
@{*/

/** RCC_C1_AHB1LPENR_USB2ULPILPEN USB_PHY2 clocks enable during CSleep mode **/
#define RCC_C1_AHB1LPENR_USB2ULPILPEN		(1 << 28)
/** RCC_C1_AHB1LPENR_USB2OTGLPEN USB2OTG peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB1LPENR_USB2OTGLPEN		(1 << 27)
/** RCC_C1_AHB1LPENR_USB1ULPILPEN USB_PHY1 clock enable during CSleep mode **/
#define RCC_C1_AHB1LPENR_USB1ULPILPEN		(1 << 26)
/** RCC_C1_AHB1LPENR_USB1OTGLPEN USB1OTG peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB1LPENR_USB1OTGLPEN		(1 << 25)
/** RCC_C1_AHB1LPENR_ETH1RXLPEN Ethernet Reception Clock Enable During CSleep Mode **/
#define RCC_C1_AHB1LPENR_ETH1RXLPEN		(1 << 17)
/** RCC_C1_AHB1LPENR_ETH1TXLPEN Ethernet Transmission Clock Enable During CSleep Mode **/
#define RCC_C1_AHB1LPENR_ETH1TXLPEN		(1 << 16)
/** RCC_C1_AHB1LPENR_ETH1MACLPEN Ethernet MAC bus interface Clock Enable During CSleep Mode **/
#define RCC_C1_AHB1LPENR_ETH1MACLPEN		(1 << 15)
/** RCC_C1_AHB1LPENR_ADC12LPEN ADC1/2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_AHB1LPENR_ADC12LPEN		(1 << 5)
/** RCC_C1_AHB1LPENR_DMA2LPEN DMA2 Clock Enable During CSleep Mode **/
#define RCC_C1_AHB1LPENR_DMA2LPEN		(1 << 1)
/** RCC_C1_AHB1LPENR_DMA1LPEN DMA1 Clock Enable During CSleep Mode **/
#define RCC_C1_AHB1LPENR_DMA1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb2lpenr C1AHB2LPENR RCC AHB2 Sleep Clock Register
@{*/

/** RCC_C1_AHB2LPENR_SRAM3LPEN SRAM3 Clock Enable During CSleep Mode **/
#define RCC_C1_AHB2LPENR_SRAM3LPEN		(1 << 31)
/** RCC_C1_AHB2LPENR_SRAM2LPEN SRAM2 Clock Enable During CSleep Mode **/
#define RCC_C1_AHB2LPENR_SRAM2LPEN		(1 << 30)
/** RCC_C1_AHB2LPENR_SRAM1LPEN SRAM1 Clock Enable During CSleep Mode **/
#define RCC_C1_AHB2LPENR_SRAM1LPEN		(1 << 29)
/** RCC_C1_AHB2LPENR_SDMMC2LPEN SDMMC2 and SDMMC2 Delay Clock Enable During CSleep Mode **/
#define RCC_C1_AHB2LPENR_SDMMC2LPEN		(1 << 9)
/** RCC_C1_AHB2LPENR_RNGLPEN RNG peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB2LPENR_RNGLPEN		(1 << 6)
/** RCC_C1_AHB2LPENR_HASHLPEN HASH peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB2LPENR_HASHLPEN		(1 << 5)
/** RCC_C1_AHB2LPENR_CRYPTLPEN CRYPT peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB2LPENR_CRYPTLPEN		(1 << 4)
/** RCC_C1_AHB2LPENR_CAMITFLPEN CAMITF peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB2LPENR_CAMITFLPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb4lpenr C1AHB4LPENR RCC AHB4 Sleep Clock Register
@{*/

/** RCC_C1_AHB4LPENR_SRAM4LPEN SRAM4 Clock Enable During CSleep Mode **/
#define RCC_C1_AHB4LPENR_SRAM4LPEN		(1 << 29)
/** RCC_C1_AHB4LPENR_BKPRAMLPEN Backup RAM Clock Enable During CSleep Mode **/
#define RCC_C1_AHB4LPENR_BKPRAMLPEN		(1 << 28)
/** RCC_C1_AHB4LPENR_ADC3LPEN ADC3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_AHB4LPENR_ADC3LPEN		(1 << 24)
/** RCC_C1_AHB4LPENR_BDMALPEN BDMA Clock Enable During CSleep Mode **/
#define RCC_C1_AHB4LPENR_BDMALPEN		(1 << 21)
/** RCC_C1_AHB4LPENR_CRCLPEN CRC peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_CRCLPEN		(1 << 19)
/** RCC_C1_AHB4LPENR_GPIOKLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOKLPEN		(1 << 10)
/** RCC_C1_AHB4LPENR_GPIOJLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOJLPEN		(1 << 9)
/** RCC_C1_AHB4LPENR_GPIOILPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOILPEN		(1 << 8)
/** RCC_C1_AHB4LPENR_GPIOHLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOHLPEN		(1 << 7)
/** RCC_C1_AHB4LPENR_GPIOGLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOGLPEN		(1 << 6)
/** RCC_C1_AHB4LPENR_GPIOFLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOFLPEN		(1 << 5)
/** RCC_C1_AHB4LPENR_GPIOELPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOELPEN		(1 << 4)
/** RCC_C1_AHB4LPENR_GPIODLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIODLPEN		(1 << 3)
/** RCC_C1_AHB4LPENR_GPIOCLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOCLPEN		(1 << 2)
/** RCC_C1_AHB4LPENR_GPIOBLPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOBLPEN		(1 << 1)
/** RCC_C1_AHB4LPENR_GPIOALPEN GPIO peripheral clock enable during CSleep mode **/
#define RCC_C1_AHB4LPENR_GPIOALPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_apb3lpenr C1APB3LPENR RCC APB3 Sleep Clock Register
@{*/

/** RCC_C1_APB3LPENR_WWDG1LPEN WWDG1 Clock Enable During CSleep Mode **/
#define RCC_C1_APB3LPENR_WWDG1LPEN		(1 << 6)
/** RCC_C1_APB3LPENR_LTDCLPEN LTDC peripheral clock enable during CSleep mode **/
#define RCC_C1_APB3LPENR_LTDCLPEN		(1 << 3)

/**@}*/

/** @defgroup rcc_c1_apb1llpenr C1APB1LLPENR RCC APB1 Low Sleep Clock Register
@{*/

/** RCC_C1_APB1LLPENR_USART8LPEN USART8 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_USART8LPEN		(1 << 31)
/** RCC_C1_APB1LLPENR_USART7LPEN USART7 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_USART7LPEN		(1 << 30)
/** RCC_C1_APB1LLPENR_DAC12LPEN DAC1/2 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_DAC12LPEN		(1 << 29)
/** RCC_C1_APB1LLPENR_HDMICECLPEN HDMI-CEC Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_HDMICECLPEN		(1 << 27)
/** RCC_C1_APB1LLPENR_I2C3LPEN I2C3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_I2C3LPEN		(1 << 23)
/** RCC_C1_APB1LLPENR_I2C2LPEN I2C2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_I2C2LPEN		(1 << 22)
/** RCC_C1_APB1LLPENR_I2C1LPEN I2C1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_I2C1LPEN		(1 << 21)
/** RCC_C1_APB1LLPENR_UART5LPEN UART5 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_UART5LPEN		(1 << 20)
/** RCC_C1_APB1LLPENR_UART4LPEN UART4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_UART4LPEN		(1 << 19)
/** RCC_C1_APB1LLPENR_USART3LPEN USART3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_USART3LPEN		(1 << 18)
/** RCC_C1_APB1LLPENR_USART2LPEN USART2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_USART2LPEN		(1 << 17)
/** RCC_C1_APB1LLPENR_SPDIFRXLPEN SPDIFRX Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_SPDIFRXLPEN		(1 << 16)
/** RCC_C1_APB1LLPENR_SPI3LPEN SPI3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_SPI3LPEN		(1 << 15)
/** RCC_C1_APB1LLPENR_SPI2LPEN SPI2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_SPI2LPEN		(1 << 14)
/** RCC_C1_APB1LLPENR_LPTIM1LPEN LPTIM1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1LLPENR_LPTIM1LPEN		(1 << 9)
/** RCC_C1_APB1LLPENR_TIM14LPEN TIM14 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM14LPEN		(1 << 8)
/** RCC_C1_APB1LLPENR_TIM13LPEN TIM13 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM13LPEN		(1 << 7)
/** RCC_C1_APB1LLPENR_TIM12LPEN TIM12 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM12LPEN		(1 << 6)
/** RCC_C1_APB1LLPENR_TIM7LPEN TIM7 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM7LPEN		(1 << 5)
/** RCC_C1_APB1LLPENR_TIM6LPEN TIM6 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM6LPEN		(1 << 4)
/** RCC_C1_APB1LLPENR_TIM5LPEN TIM5 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM5LPEN		(1 << 3)
/** RCC_C1_APB1LLPENR_TIM4LPEN TIM4 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM4LPEN		(1 << 2)
/** RCC_C1_APB1LLPENR_TIM3LPEN TIM3 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM3LPEN		(1 << 1)
/** RCC_C1_APB1LLPENR_TIM2LPEN TIM2 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1LLPENR_TIM2LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_apb1hlpenr C1APB1HLPENR RCC APB1 High Sleep Clock Register
@{*/

/** RCC_C1_APB1HLPENR_FDCANLPEN FDCAN Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1HLPENR_FDCANLPEN		(1 << 8)
/** RCC_C1_APB1HLPENR_MDIOSLPEN MDIOS peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1HLPENR_MDIOSLPEN		(1 << 5)
/** RCC_C1_APB1HLPENR_OPAMPLPEN OPAMP peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1HLPENR_OPAMPLPEN		(1 << 4)
/** RCC_C1_APB1HLPENR_SWPLPEN SWPMI Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB1HLPENR_SWPLPEN		(1 << 2)
/** RCC_C1_APB1HLPENR_CRSLPEN Clock Recovery System peripheral clock enable during CSleep mode **/
#define RCC_C1_APB1HLPENR_CRSLPEN		(1 << 1)

/**@}*/

/** @defgroup rcc_c1_apb2lpenr C1APB2LPENR RCC APB2 Sleep Clock Register
@{*/

/** RCC_C1_APB2LPENR_HRTIMLPEN HRTIM peripheral clock enable during CSleep mode **/
#define RCC_C1_APB2LPENR_HRTIMLPEN		(1 << 29)
/** RCC_C1_APB2LPENR_DFSDM1LPEN DFSDM1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_DFSDM1LPEN		(1 << 28)
/** RCC_C1_APB2LPENR_SAI3LPEN SAI3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_SAI3LPEN		(1 << 24)
/** RCC_C1_APB2LPENR_SAI2LPEN SAI2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_SAI2LPEN		(1 << 23)
/** RCC_C1_APB2LPENR_SAI1LPEN SAI1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_SAI1LPEN		(1 << 22)
/** RCC_C1_APB2LPENR_SPI5LPEN SPI5 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_SPI5LPEN		(1 << 20)
/** RCC_C1_APB2LPENR_TIM17LPEN TIM17 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB2LPENR_TIM17LPEN		(1 << 18)
/** RCC_C1_APB2LPENR_TIM16LPEN TIM16 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB2LPENR_TIM16LPEN		(1 << 17)
/** RCC_C1_APB2LPENR_TIM15LPEN TIM15 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB2LPENR_TIM15LPEN		(1 << 16)
/** RCC_C1_APB2LPENR_SPI4LPEN SPI4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_SPI4LPEN		(1 << 13)
/** RCC_C1_APB2LPENR_SPI1LPEN SPI1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_SPI1LPEN		(1 << 12)
/** RCC_C1_APB2LPENR_USART6LPEN USART6 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_USART6LPEN		(1 << 5)
/** RCC_C1_APB2LPENR_USART1LPEN USART1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB2LPENR_USART1LPEN		(1 << 4)
/** RCC_C1_APB2LPENR_TIM8LPEN TIM8 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB2LPENR_TIM8LPEN		(1 << 1)
/** RCC_C1_APB2LPENR_TIM1LPEN TIM1 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB2LPENR_TIM1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_apb4lpenr C1APB4LPENR RCC APB4 Sleep Clock Register
@{*/

/** RCC_C1_APB4LPENR_SAI4LPEN SAI4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_SAI4LPEN		(1 << 21)
/** RCC_C1_APB4LPENR_RTCAPBLPEN RTC APB Clock Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_RTCAPBLPEN		(1 << 16)
/** RCC_C1_APB4LPENR_VREFLPEN VREF peripheral clock enable during CSleep mode **/
#define RCC_C1_APB4LPENR_VREFLPEN		(1 << 15)
/** RCC_C1_APB4LPENR_COMP12LPEN COMP1/2 peripheral clock enable during CSleep mode **/
#define RCC_C1_APB4LPENR_COMP12LPEN		(1 << 14)
/** RCC_C1_APB4LPENR_LPTIM5LPEN LPTIM5 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_LPTIM5LPEN		(1 << 12)
/** RCC_C1_APB4LPENR_LPTIM4LPEN LPTIM4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_LPTIM4LPEN		(1 << 11)
/** RCC_C1_APB4LPENR_LPTIM3LPEN LPTIM3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_LPTIM3LPEN		(1 << 10)
/** RCC_C1_APB4LPENR_LPTIM2LPEN LPTIM2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_LPTIM2LPEN		(1 << 9)
/** RCC_C1_APB4LPENR_I2C4LPEN I2C4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_I2C4LPEN		(1 << 7)
/** RCC_C1_APB4LPENR_SPI6LPEN SPI6 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_SPI6LPEN		(1 << 5)
/** RCC_C1_APB4LPENR_LPUART1LPEN LPUART1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_C1_APB4LPENR_LPUART1LPEN		(1 << 3)
/** RCC_C1_APB4LPENR_SYSCFGLPEN SYSCFG peripheral clock enable during CSleep mode **/
#define RCC_C1_APB4LPENR_SYSCFGLPEN		(1 << 1)

/**@}*/
